DataProcessors/ЛБ_РасхожденияLX.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЛБ_РасхожденияLX</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/ЛБ_РасчетыСКлиентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_РасчетыСКлиентами</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейРасчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыРасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачалаРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ЛБ_РасчетыСКлиентамиБУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_РасчетыСКлиентамиБУ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыРасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачалаРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ЛБ_ВидыРасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыРасчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоПроцентам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоОсновномуДолгу</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ЛБ_РасхожденияLX/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВыбратьПериод(Команда)
	ПараметрыВыбора = Новый Структура("НачалоПериода,КонецПериода", pDb, pDe);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериода", ПараметрыВыбора, Элементы.ВыбратьПериод, , , , ОписаниеОповещения);
КонецПроцедуры

функция OpenRs_(ТекстSQL,CATALOG)
	Если CATALOG тогда
		Подключение ="Provider=SQLOLEDB.1;data PROVIDER=SQLOLEDB.1;PASSWORD=123456;PERSIST SECURITY INFO=TRUE;USER ID=elix;INITIAL CATALOG=dlink;DATA SOURCE=192.168.0.244";
	Иначе
		Подключение ="Provider=SQLOLEDB.1;data PROVIDER=SQLOLEDB.1;PASSWORD=123456;PERSIST SECURITY INFO=TRUE;USER ID=elix;INITIAL CATALOG=dcbdl;DATA SOURCE=192.168.0.244";	
	КонецЕсли;
	СоединениеSQL = Новый COMObject("ADODB.Connection");
	СоединениеSQL.ConnectionString = Подключение;
	СоединениеSQL.Open();
	СоединениеSQL.commandTimeout=600;
	ЗаписиSQL = Новый COMObject("ADODB.Recordset");
	ЗаписиSQL.CursorLocation = 3;
	ЗаписиSQL.Open (ТекстSQL, СоединениеSQL,,3) ;
	возврат  ЗаписиSQL;
конецфункции


Функция ВернутьСтатусЗБ(НомерЗБ)
	Рез  = "";
	
	ТекстSQL  = "select stat from azb where nomer = " + СокрЛП(НомерЗБ);
 
	rt = OpenRs_(ТекстSQL,Ложь);
	
	Пока не rt.eof() цикл
		Если не rt.eof() Тогда 
			
			Рез = rt.fields("Stat").value; 
			
			
			rt.movenext();	
		КонецЕсли;
	КонецЦикла; 

	Возврат Рез;
	
	
КонецФункции

Процедура УдалитьЗБСоСтатусом(стрСтатус, тзСтатусов, тз)
	
	отб1 = Новый Структура("СтатусLX", стрСтатус);
	ЗБОтгр = тзСтатусов.НайтиСтроки(отб1);  
	МассивЗБ = Новый Массив;
	Для каждого элЗБОтгр из ЗБОтгр Цикл	
		СтруктураОтбора = Новый Структура("НомерЗБ", элЗБОтгр.НомерЗБ);
		МассивСтрок = тз.НайтиСтроки(СтруктураОтбора);
		Для Каждого ЭлементМассив Из МассивСтрок Цикл
			тз.Удалить(ЭлементМассив); 
		КонецЦикла;
	КонецЦикла;   
	
КонецПроцедуры

&НаСервере
Функция РасхожденияНовНаСервере()
	
	pndoc = "";
	pplat = "";
	
	//Если ЗначениеЗаполнено(Ломбард) Тогда
	//	промЛ = СокрЛП(Ломбард);
	//	позН  = СтрНайти(промЛ, "№");
	//	pplat = Сред(промЛ, позН+2);
	//КонецЕсли;
	
	//db = "'" + pDb + "'";
	de = "'" + pDe + "'";
	
	тз = Новый ТаблицаЗначений;
	тз.Колонки.Добавить("НомерЗБ");
	тз.Колонки.Добавить("ДатаДок");
	тз.Колонки.Добавить("ЛомбардСтр");
	тз.Колонки.Добавить("nObj");
	тз.Колонки.Добавить("Ломбард");  
	тз.Колонки.Добавить("StatTo");  
	тз.Колонки.Добавить("СтатусLX"); 
	тз.Колонки.Добавить("Тело",     Новый ОписаниеТипов("Число"));
	тз.Колонки.Добавить("Проценты", Новый ОписаниеТипов("Число"));	
	тз.Колонки.Добавить("Сумма1С",  Новый ОписаниеТипов("Число"));
	тз.Колонки.Добавить("Сумма1С_Проценты",  Новый ОписаниеТипов("Число"));
	
	//сЛомбарды = Новый Соответствие; 
	//мЗакрытыеПодразделения = дуДополнительныеНастройки.ПолучитьЗначениеДопНастройки("ЗакрытыеПодразделения");
	//Организация = Справочники.Организации.НайтиПоКоду("БП-000001");
	         
	
	ТекстSQL  = "select * FROM Zazb_ostproc_axi  where dproc = " + de;
	Если ЗначениеЗаполнено(Ломбард) Тогда
		ТекстSQL = ТекстSQL +" and nobj = '"+СокрЛП(Ломбард.id_LX)+"'";			
	КонецЕсли;
	Если ЗначениеЗаполнено(ЗБ) Тогда
		ТекстSQL = ТекстSQL +" and nomer = '"+ЗБ+"'";			
	КонецЕсли;
	
 
	rt = OpenRs_(ТекстSQL,Ложь);
	
	СоответствияСтатусов = ЛБ_ОбщегоНазначения.СоответствиеСтатусовLXи1С();
	Пока не rt.eof() цикл
		Если не rt.eof() Тогда 
			Попытка
			НовСтр = тз.Добавить();
			НовСтр.НомерЗБ         = rt.fields("Nomer").value;
			НовСтр.StatTo          = rt.fields("StatTo").value; 
			НовСтр.СтатусLX        = СоответствияСтатусов.Получить(СокрЛП(НовСтр.StatTo));			
			НовСтр.nObj            = rt.fields("nObj").value;
			НовСтр.ЛомбардСтр      = rt.fields("PLAT").value;  			
			НовСтр.Тело        	   = Окр(rt.fields("sKred").value,2);
			НовСтр.Проценты        = Окр(rt.fields("sProc").value,2);
			
			НовСтр.Ломбард    = ЛБ_ОбменLX.ВернутьЛомбардПоID(СокрЛП(НовСтр.nObj));

		Исключение
			Сообщить("Не смог загрузить: "+rt.fields("Nomer").value);
		КонецПопытки;
			
			rt.movenext();	
		КонецЕсли;
	КонецЦикла;   
	
	тзСтатусов = тз.Скопировать(, "НомерЗБ,СтатусLX");
		
		
	тз.Индексы.Добавить("НомерЗБ"); 
	
	тзСтат = тз.Скопировать();

                    			
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА ЛБ_РасчетыСКлиентамиОстатки.ВидРасчета = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыРасчетов.ПоОсновномуДолгу)
	               |			ТОГДА ЛБ_РасчетыСКлиентамиОстатки.СуммаОстаток
	               |	КОНЕЦ КАК Сумма1С,
	               |	ЛБ_РасчетыСКлиентамиОстатки.ЗалоговыйБилет.НомерЗалоговогоБилета КАК НомерЗБ,
	               |	ЛБ_РасчетыСКлиентамиОстатки.ЗалоговыйБилет.Ломбард КАК Ломбард,
	               |	ЛБ_РасчетыСКлиентамиОстатки.ЗалоговыйБилет.ДатаВыкупа КАК ДатаВыкупа,
	               |	ЛБ_РасчетыСКлиентамиОстатки.ЗалоговыйБилет.Дата КАК ДатаДок,
	               |	СУММА(ЛБ_РасчетыСКлиентамиОстатки.ЗалоговыйБилет.СуммаСсуды) КАК СуммаСсуды,
	               |	СУММА(ЕСТЬNULL(ВложенныйЗапрос.СуммаПроцентов, 0)) КАК СуммаПроцентовНач,
	               |	0 КАК Сумма1С_Проценты
	               |ИЗ
	               |	РегистрНакопления.ЛБ_РасчетыСКлиентами.Остатки(
	               |			&НаДату,
	               |			ИСТИНА
	               |				И 100 = 100
	               |				И 200 = 200) КАК ЛБ_РасчетыСКлиентамиОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ЛБ_ОперацияПоЗалогуГрафикПлатежей.СуммаПроцентов КАК СуммаПроцентов,
	               |			ЛБ_ОперацияПоЗалогуГрафикПлатежей.Ссылка КАК Ссылка
	               |		ИЗ
	               |			Документ.ЛБ_ОперацияПоЗалогу.ГрафикПлатежей КАК ЛБ_ОперацияПоЗалогуГрафикПлатежей) КАК ВложенныйЗапрос
	               |		ПО ЛБ_РасчетыСКлиентамиОстатки.ЗалоговыйБилет = ВложенныйЗапрос.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ЛБ_РасчетыСКлиентамиБУОстатки.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |			ЛБ_РасчетыСКлиентамиБУОстатки.СуммаОстаток КАК СуммаОстаток
	               |		ИЗ
	               |			РегистрНакопления.ЛБ_РасчетыСКлиентамиБУ.Остатки(&НаДату, ВидРасчета = &ВидРасчета) КАК ЛБ_РасчетыСКлиентамиБУОстатки) КАК ВложенныйЗапрос1
	               |		ПО ЛБ_РасчетыСКлиентамиОстатки.ЗалоговыйБилет = ВложенныйЗапрос1.ЗалоговыйБилет
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_РасчетыСКлиентамиОстатки.ЗалоговыйБилет.НомерЗалоговогоБилета,
	               |	ЛБ_РасчетыСКлиентамиОстатки.ЗалоговыйБилет.ДатаВыкупа,
	               |	ЛБ_РасчетыСКлиентамиОстатки.ЗалоговыйБилет.Ломбард,
	               |	ЛБ_РасчетыСКлиентамиОстатки.ЗалоговыйБилет.Дата,
	               |	ВЫБОР
	               |		КОГДА ЛБ_РасчетыСКлиентамиОстатки.ВидРасчета = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыРасчетов.ПоОсновномуДолгу)
	               |			ТОГДА ЛБ_РасчетыСКлиентамиОстатки.СуммаОстаток
	               |	КОНЕЦ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	0,
	               |	ЛБ_РасчетыСКлиентамиБУОстатки.ЗалоговыйБилет.НомерЗалоговогоБилета,
	               |	ЛБ_РасчетыСКлиентамиБУОстатки.Ломбард,
	               |	NULL,
	               |	NULL,
	               |	0,
	               |	0,
	               |	ЛБ_РасчетыСКлиентамиБУОстатки.СуммаОстаток
	               |ИЗ
	               |	РегистрНакопления.ЛБ_РасчетыСКлиентамиБУ.Остатки(
	               |			&НаДату,
	               |			ВидРасчета = &ВидРасчета
	               |				И 100 = 100
	               |				И 200 = 200) КАК ЛБ_РасчетыСКлиентамиБУОстатки"; 
	
	Граница = Новый Граница(КонецДня(pDe), ВидГраницы.Включая);
	Запрос.УстановитьПараметр("НаДату",     Граница); 
	Запрос.УстановитьПараметр("ВидРасчета", Перечисления.ЛБ_ВидыРасчетов.ПоПроцентам);

	
	Если ЗначениеЗаполнено(ЗБ) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "100 = 100", "ЗалоговыйБилет.НомерЗалоговогоБилета = &ЗБ");
		Запрос.УстановитьПараметр("ЗБ", ЗБ);
	КонецЕсли;
	Если ЗначениеЗаполнено(Ломбард) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "200 = 200", "ЗалоговыйБилет.Ломбард = &Ломбард");
		Запрос.УстановитьПараметр("Ломбард", Ломбард);
	КонецЕсли;
	
	
	тз1С = Запрос.Выполнить().Выгрузить(); 
	
		
	Для каждого стр из тз1С Цикл
		НовСтр = тз.Добавить();	
		
		//СрокРасчета = (стр.ДатаВыкупа - НачалоДня(стр.ДатаДок))/(24*60*60);
	   // Стр.ПСК_1С = ЛБ_УправлениеЛомбардом.РасчетПСКГод(СрокРасчета, стр.СуммаСсуды, стр.СуммаПроцентовНач);
       		
		ЗаполнитьЗначенияСвойств(НовСтр, стр);
	КонецЦикла;
	
	
	Таб = Новый ТабличныйДокумент;
	
	ПечатнаяФормаОбъект = РеквизитФормыВЗначение("Объект");
	Макет = ПечатнаяФормаОбъект.ПолучитьМакет("Макет");
	
	Область = Макет.ПолучитьОбласть("Шапка");
	Область.Параметры.ДатаОтчета = Формат(pDe,"ДФ=dd.MM.yy");
	Таб.Вывести(Область);
	
	 		
	тз.Свернуть("Ломбард, НомерЗБ", "Проценты, Тело, Сумма1С, Сумма1С_Проценты");
	
	УдалитьЗБСоСтатусом("Отгружен", тзСтатусов, тз); 
	УдалитьЗБСоСтатусом("Объявл.Торг", тзСтатусов, тз);  

	
			
	
	
	Если Тело и НЕ Проценты Тогда
		тз.Свернуть("Ломбард, НомерЗБ", "Тело, Сумма1С");
	КонецЕсли;
	
	Если Проценты и Не Тело Тогда
		тз.Свернуть("Ломбард, НомерЗБ", "Проценты,  Сумма1С_Проценты"); 	
	КонецЕсли;
	

		
	
	тзЛомбарды = тз.Скопировать();
	тзЛомбарды.Свернуть("Ломбард");
	
	Таб.НачатьАвтогруппировкуСтрок();
	
	Для каждого БигСтр из тзЛомбарды Цикл
		Область = Макет.ПолучитьОбласть("Ломбард");
		Область.Параметры.Ломбард = БигСтр.Ломбард;  		
		
		
		Отб = Новый Структура("Ломбард", БигСтр.Ломбард);
		
		НайдСтроч = тз.НайтиСтроки(отб);   	
		
		ИтогСуммаLX_тело = 0;
		ИтогСумма1С_тело = 0;
		ИтогРазница_тело = 0;
		
		ИтогСуммаLX_проценты = 0;
		ИтогСумма1С_проценты = 0;
		ИтогРазница_проценты = 0;
		
		Для каждого стр из НайдСтроч Цикл 
			Если Тело и Проценты Тогда
			
			Если (стр.Сумма1С <> стр.Тело) или (стр.Проценты <> стр.Сумма1С_Проценты) Тогда  
				РазницаТело = стр.Сумма1С - стр.Тело; 
				РазницаПроценты = стр.Проценты - стр.Сумма1С_Проценты;
				МодульРазницаТело = ?(РазницаТело > 0, РазницаТело, -РазницаТело); 
				МодульРазницаПроценты = ?(РазницаПроценты > 0, РазницаПроценты, -РазницаПроценты);

				Если (МодульРазницаТело < 0.3) и (МодульРазницаПроценты < 0.3) и СпрятатьКопейки Тогда
					
				Иначе
					
				ИтогСуммаLX_тело = ИтогСуммаLX_тело + стр.Тело;
				ИтогСумма1С_тело = ИтогСумма1С_тело + стр.Сумма1С;
				ИтогРазница_тело = ИтогРазница_тело + (стр.Тело -  стр.Сумма1С);
				
				ИтогСуммаLX_проценты = ИтогСуммаLX_проценты + стр.Проценты;
				ИтогСумма1С_проценты = ИтогСумма1С_проценты + стр.Сумма1С_Проценты;
				ИтогРазница_проценты = ИтогРазница_проценты + (стр.Проценты - стр.Сумма1С_Проценты);
				КонецЕсли;
			КонецЕсли; 
		ИначеЕсли Тело и НЕ ПРоценты Тогда
			
			Если (стр.Сумма1С <> стр.Тело)  Тогда  
				РазницаТело = стр.Сумма1С - стр.Тело; 
				//РазницаПроценты = стр.Проценты - стр.Сумма1С_Проценты;
				МодульРазницаТело = ?(РазницаТело > 0, РазницаТело, -РазницаТело); 
				//МодульРазницаПроценты = ?(РазницаПроценты > 0, РазницаПроценты, -РазницаПроценты);

				Если (МодульРазницаТело < 0.3)  и СпрятатьКопейки Тогда
					
				Иначе
					
				ИтогСуммаLX_тело = ИтогСуммаLX_тело + стр.Тело;
				ИтогСумма1С_тело = ИтогСумма1С_тело + стр.Сумма1С;
				ИтогРазница_тело = ИтогРазница_тело + (стр.Тело -  стр.Сумма1С);
				
				//ИтогСуммаLX_проценты = ИтогСуммаLX_проценты + стр.Проценты;
				//ИтогСумма1С_проценты = ИтогСумма1С_проценты + стр.Сумма1С_Проценты;
				//ИтогРазница_проценты = ИтогРазница_проценты + (стр.Проценты - стр.Сумма1С_Проценты);
				КонецЕсли;
			КонецЕсли; 
			
		ИначеЕсли Проценты и НЕ Тело Тогда  
			
			Если  (стр.Проценты <> стр.Сумма1С_Проценты) Тогда  
				//РазницаТело = стр.Сумма1С - стр.Тело; 
				РазницаПроценты = стр.Проценты - стр.Сумма1С_Проценты;
				//МодульРазницаТело = ?(РазницаТело > 0, РазницаТело, -РазницаТело); 
				МодульРазницаПроценты = ?(РазницаПроценты > 0, РазницаПроценты, -РазницаПроценты);

				Если (МодульРазницаПроценты < 0.3) и СпрятатьКопейки Тогда
					
				Иначе
					
				//ИтогСуммаLX_тело = ИтогСуммаLX_тело + стр.Тело;
				//ИтогСумма1С_тело = ИтогСумма1С_тело + стр.Сумма1С;
				//ИтогРазница_тело = ИтогРазница_тело + (стр.Тело -  стр.Сумма1С);
				
				ИтогСуммаLX_проценты = ИтогСуммаLX_проценты + стр.Проценты;
				ИтогСумма1С_проценты = ИтогСумма1С_проценты + стр.Сумма1С_Проценты;
				ИтогРазница_проценты = ИтогРазница_проценты + (стр.Проценты - стр.Сумма1С_Проценты);
				КонецЕсли;
			КонецЕсли; 
		КонецЕсли;	
			
			
		КонецЦикла;
		
		Область.Параметры.СуммаLX_тело = ИтогСуммаLX_тело;  
		Область.Параметры.Сумма1С_тело = ИтогСумма1С_тело; 
		Область.Параметры.Разница_тело = ИтогРазница_тело;
		
		Область.Параметры.СуммаLX_проценты = ИтогСуммаLX_проценты;  
		Область.Параметры.Сумма1С_проценты = ИтогСумма1С_проценты; 
		Область.Параметры.Разница_проценты = ИтогРазница_проценты;
		
		
		Таб.Вывести(Область,1); 
		
		Для каждого стр из НайдСтроч Цикл  
			Если Тело и Проценты Тогда
			Если (стр.Сумма1С <> стр.Тело) или (стр.Проценты <> стр.Сумма1С_Проценты) Тогда 
				РазницаТело = стр.Сумма1С - стр.Тело; 
				РазницаПроценты = стр.Проценты - стр.Сумма1С_Проценты;
				
				МодульРазницаТело = ?(РазницаТело > 0, РазницаТело, -РазницаТело); 
				МодульРазницаПроценты = ?(РазницаПроценты > 0, РазницаПроценты, -РазницаПроценты);

				Если (МодульРазницаТело < 0.3) и (МодульРазницаПроценты < 0.3) и СпрятатьКопейки Тогда
					
				Иначе
				Область = Макет.ПолучитьОбласть("Строка");
				Область.Параметры.Договор = стр.НомерЗБ;
				Область.Параметры.СуммаLX_тело = стр.Тело;
				Область.Параметры.Сумма1С_тело = стр.Сумма1С;
				Область.Параметры.СуммаLX_проценты = стр.Проценты;
				Область.Параметры.Сумма1С_проценты = стр.Сумма1С_Проценты;
				
				Область.Параметры.Разница_тело = стр.Тело -  стр.Сумма1С;
				Область.Параметры.Разница_проценты = стр.Проценты - стр.Сумма1С_Проценты;
				
				Если (стр.Сумма1С <> стр.Тело) Тогда
					нСтрока = тзСтат.Найти(стр.НомерЗБ);
					Если нСтрока = Неопределено Тогда
						Ста = ВернутьСтатусЗБ(стр.НомерЗБ);
						Если ста = 40 Тогда
							ПечСтат = "Передан в ЦО";
						Иначе						
							ПечСтат = "Не нашел в LX";
						КонецЕсли;
					Иначе
						найдСтат = тзСтат.Найти(стр.НомерЗБ).Statto;
						Если найдСтат = 40 Тогда
							ПечСтат = "Передан в ЦО";
						Иначе
							ПечСтат = найдСтат;
						КонецЕсли;
					КонецЕсли;

					Область.Параметры.Статус = ПечСтат;
				КонецЕсли;
				
				Таб.Вывести(Область,2);
				КонецЕсли;
			КонецЕсли; 
		ИначеЕсли Тело и НЕ Проценты Тогда 
			
			Если (стр.Сумма1С <> стр.Тело)  Тогда 
				РазницаТело = стр.Сумма1С - стр.Тело; 
				//РазницаПроценты = стр.Проценты - стр.Сумма1С_Проценты;
				
				МодульРазницаТело = ?(РазницаТело > 0, РазницаТело, -РазницаТело); 
				//МодульРазницаПроценты = ?(РазницаПроценты > 0, РазницаПроценты, -РазницаПроценты);

				Если (МодульРазницаТело < 0.3)  и СпрятатьКопейки Тогда
					
				Иначе
				Область = Макет.ПолучитьОбласть("Строка");
				Область.Параметры.Договор = стр.НомерЗБ;
				Область.Параметры.СуммаLX_тело = стр.Тело;
				Область.Параметры.Сумма1С_тело = стр.Сумма1С;
				//Область.Параметры.СуммаLX_проценты = стр.Проценты;
				//Область.Параметры.Сумма1С_проценты = стр.Сумма1С_Проценты;
				
				Область.Параметры.Разница_тело = стр.Тело -  стр.Сумма1С;
				//Область.Параметры.Разница_проценты = стр.Проценты - стр.Сумма1С_Проценты;
				
				Если (стр.Сумма1С <> стр.Тело) Тогда
					нСтрока = тзСтатусов.Найти(стр.НомерЗБ);
					Если нСтрока = Неопределено Тогда
						
						//Ста = ВернутьСтатусЗБ(стр.НомерЗБ);
						//Если ста = 40 Тогда
						//	ПечСтат = "Передан в ЦО";
						//Иначе						
							ПечСтат = "Не нашел в LX";
						//КонецЕсли;
						
						
					Иначе
						ПечСтат = тзСтатусов.Найти(стр.НомерЗБ).СтатусLX;
						//Если найдСтат = 40 Тогда
						//	ПечСтат = "Передан в ЦО";
						//Иначе
						//	ПечСтат = найдСтат;
						//КонецЕсли;
					КонецЕсли;

					Область.Параметры.Статус = ПечСтат;
				КонецЕсли;
				
				Таб.Вывести(Область,2);
				КонецЕсли;
			КонецЕсли; 

			
		ИначеЕсли Проценты и Не Тело Тогда
			
		КонецЕсли;
			
		КонецЦикла; 
	КонецЦикла;
	
	таб.ЗакончитьАвтогруппировкуСтрок();
	
	//отб = Новый Структура("Найден", Ложь);
	
	//НайдСтроки = тз1С.НайтиСтроки(отб);
	//Для каждого стр из НайдСтроки Цикл   		
	//	Область = Макет.ПолучитьОбласть("Строка");
	//	Область.Параметры.Договор = стр.Договор;
	//	Область.Параметры.СуммаLX = 0;
	//	Область.Параметры.Сумма1С = стр.СуммаОстатокДт;
	//	
	//	Таб.Вывести(Область);  		
	//КонецЦикла;  
	
	Таб.ФиксацияСверху = 3;

	Возврат Таб;		

	
	
	
	
КонецФункции


&НаКлиенте
Процедура РасхожденияНов(Команда)
	
	pDb = НачалоМесяца(pDb);
	pDe = КонецМесяца(pDe);
	
	т = РасхожденияНовНаСервере(); 	
	т.Показать(Формат(pDe,"ДФ=dd.MM.yy")+ " Расхождения 1с и LX"); 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Тело = Истина;
КонецПроцедуры
